Revit 2027 API
ExternalDefinitionCreationOptions.GetDataType Method
 Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetDataType()
Public Function GetDataType As ForgeTypeId
public:
ForgeTypeId^ GetDataType()
member GetDataType : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace